<template>
    <section class="py-6 pt-0 sm:py-16  px-6 md:px-20">
        <div class="max-w-7xl mx-auto grid md:grid-cols-2 gap-12">
            <!-- Left Side (Image and Text) -->
            <div class="flex justify-start flex-col">
                <div class="flex items-center h-[220px] overflow-hidden">
                    <Lottie style="height: 400px;" :data="Thinking"/>
                </div>
                <h2 class="text-left text-3xl md:text-3xl font-bold mb-1">
                  সচরাচর জানতে চাওয়া<br>
                  <span class="text-rose-500">প্রশ্নের উত্তর</span>
                </h2>
                <p class="leading-relaxed text-xs sm:text-sm">
                    আপনাদের কমন কিছু প্রশ্নের উত্তর আমরা এখানে লিস্ট করে দিয়েছি। আমাদের কে প্রশ্ন করার
                    পূর্বে এই লিস্টটি একবার পড়ে নেওয়ার অনুরোধ থাকলো। তাহলে আমাদের উত্তরের জন্য
                    আপনাকে অপেক্ষা করতে হবে না এবং আপনার মূল্যবান সময় বেঁচে যাবে।
                </p>
            </div>

            <!-- Right Side (FAQ Accordion) -->
            <div class="">
                <UAccordion :items="faqItems" color="blue" class="" />
            </div>
        </div>
    </section>
</template>

<script setup>
import Thinking from '~/assets/lottie/Thinking.json'
const faqItems = [
  {
    label: 'প্যাকেজ কেনার পর আমি কি কি সুবিধা পাবো?',
    content: 'আপনি আমাদের প্লান অনুযায়ী একটি সম্পূর্ণ রেডি-টু-লঞ্চ সেলস ফানেল, প্রিমিয়াম প্লাগইন, অটোমেশন সিস্টেম এবং ফুল সাপোর্ট পাবেন।'
  },
  {
    label: 'পেমেন্ট করার পরে কতদিনে কাজ ডেলিভারি পাবো?',
    content: 'সাধারণত পেমেন্ট নিশ্চিত হওয়ার ৫-৭ কার্যদিবসের মধ্যে আপনার কাজ সম্পূর্ণ করে ডেলিভার করা হবে।'
  },
  {
    label: 'আমাদের কি নিজস্ব ডোমেইন-হোস্টিং লাগবে?',
    content: 'না, আপনি চাইলে আমাদের হোস্টিং সহ প্যাকেজ নিতে পারেন, অথবা আপনার নিজস্ব ডোমেইন-হোস্টিং ব্যবহার করতে পারেন।'
  },
  {
    label: 'আমি কি নিজের মতো করে কনটেন্ট পরিবর্তন করতে পারবো?',
    content: 'হ্যাঁ, আমরা এমনভাবে ফানেল ডিজাইন করি যাতে আপনি সহজেই কনটেন্ট এডিট করতে পারেন। পাশাপাশি টিউটোরিয়ালও দিবো।'
  },
  {
    label: 'লাইভ চ্যাট বা ইনভয়েস সিস্টেম কি সব প্যাকেজে থাকবে?',
    content: 'না, এই ফিচারগুলো নির্দিষ্ট প্যাকেজে অন্তর্ভুক্ত। আপনি চাইলে আলাদাভাবে যুক্তও করতে পারবেন।'
  },
  {
    label: 'ওয়েবসাইট কি মোবাইল ফ্রেন্ডলি হবে?',
    content: 'অবশ্যই। আমাদের সব ফানেল এবং ওয়েবসাইট ডিজাইন রেসপনসিভ এবং মোবাইল ফ্রেন্ডলি।'
  },
  {
    label: 'প্রজেক্ট ডেলিভারির পর সাপোর্ট পাবো কি?',
    content: 'হ্যাঁ, প্রতিটি প্যাকেজে নির্দিষ্ট সময়ের জন্য ফ্রি সাপোর্ট থাকে। চাইলে অতিরিক্ত সাপোর্টও নিতে পারবেন।'
  },
  {
    label: 'প্যাকেজ কাস্টমাইজ করা যাবে কি?',
    content: 'হ্যাঁ, আপনি চাইলে আপনার চাহিদা অনুযায়ী কাস্টমাইজ প্যাকেজ তৈরি করতে পারবেন। আমাদের টিম আপনাকে গাইড করবে।'
  },
    {
    label: 'ওয়েবসাইট কি মোবাইল ফ্রেন্ডলি হবে?',
    content: 'অবশ্যই। আমাদের সব ফানেল এবং ওয়েবসাইট ডিজাইন রেসপনসিভ এবং মোবাইল ফ্রেন্ডলি।'
  },

]
</script>

<style lang="scss" scoped></style>