<template>
    <div id="pricing" class="py-20 sm:px-4 max-w-7xl mx-auto" :class="{ 'dark': darkMode }">
        <div class="text-center mb-10">
            <!-- Heading -->
            <h2 class="text-3xl md:text-4xl font-bold">
                আমাদের সকল <span class="text-rose-500">প্রাইসিং প্লান</span>
            </h2>
            <p class="mt-2 text-sm sm:text-lg">আপনার প্রয়োজন অনুযায়ী বেছে নিন আমাদের সহজ ও মানানসই প্রাইসিং প্লান।</p>
        </div>

        <!-- Pricing Cards -->
        <div class="grid gap-6 lg:grid-cols-2 lg:px-28">
            <ManagementPricingCard v-for="plan in plans" :key="plan.name" :plan="plan"
                :highlighted="plan.name === 'ই-কমার্স ওয়েবসাইট'" />
        </div>
    </div>
</template>

<script setup>
const darkMode = false

const plans = [
    {
        name: 'বিজনেস ওয়েবসাইট',
        monthly: '২,০০০',
        description: 'আপনি যদি একটু অ্যাডভান্সড ফিচার চান এবং বিজনেসকে পরবর্তী ধাপে নিতে চান, তাহলে এই প্যাকেজটি আপনার জন্য পারফেক্ট।',
        features: [
            'প্রিমিয়াম সেলস ফানেল ডিজাইন',
            'প্রিমিয়াম প্লাগইন ব্যবহার করা হয়েছে',
            'সহজ অর্ডার সিস্টেম ও অটোমেশন',
            'অটো ইনভয়েস প্রিন্ট ও লাইভ চ্যাট',
            'সম্পূর্ণ টিউটোরিয়াল প্রদান করা হবে',
            'প্রফেশনাল সার্ভার-সাইড ট্র্যাকিং',
            'স্পিড অপটিমাইজেশন',
            'সকাল ৬টা থেকে সন্ধ্যা ৬:৩০ পর্যন্ত সাপোর্ট',
        ],
    },
    {
        name: 'ই-কমার্স ওয়েবসাইট',
        monthly: '৪,০০০',
        description: 'এটা আমাদের অল-ইন-ওয়ান প্যাকেজ। যারা প্রফেশনাল লেভেলের সাপোর্ট ও সর্বোচ্চ রেজাল্ট চান, তাদের জন্য এটা সবচেয়ে উপযুক্ত।',
        features: [
            'প্রিমিয়াম সেলস ফানেল ডিজাইন',
            'প্রিমিয়াম প্লাগইন ব্যবহার করা হয়েছে',
            'সহজ অর্ডার সিস্টেম ও অটোমেশন',
            'অটো ইনভয়েস প্রিন্ট ও লাইভ চ্যাট',
            'সম্পূর্ণ টিউটোরিয়াল প্রদান করা হবে',
            'প্রফেশনাল সার্ভার-সাইড ট্র্যাকিং',
            'স্পিড অপটিমাইজেশন',
            'সকাল ৬টা থেকে সন্ধ্যা ৬:৩০ পর্যন্ত সাপোর্ট',
        ]

    },
]
</script>
